app/views/emotions/show.html.erb

SELECT "art_types".* FROM "art_types" WHERE "art_types"."emotion_id" = $1  [["emotion_id", 6]]
---
  <tbody>
    <% @emotion.art_types.each do |art_type| %>