app/controllers/art_types_controller.rb

  def index
    @art_types = ArtType.all
---
SELECT "art_types".* FROM "art_types"

  def create
    @art_type = ArtType.new(art_type_params)

    respond_to do |format|
      if @art_type.save
---
INSERT INTO "art_types" ("title", "date", "author", "interpreter", "dimention", "created_at", "updated_at", "emotion_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["title", ""], ["date", ""], ["author", ""], ["interpreter", ""], ["dimention", ""], ["created_at", "2020-01-10 15:13:23.646287"], ["updated_at", "2020-01-10 15:13:23.646287"], ["emotion_id", 6]]

  def destroy
    @art_type.destroy
---
DELETE FROM "art_types" WHERE "art_types"."id" = $1  [["id", 1]]

    def set_art_type
      @art_type = ArtType.find(params[:id])
---
SELECT  "art_types".* FROM "art_types" WHERE "art_types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]