app/controllers/emotions_controller.rb

  def index
    @emotions = Emotion.all
---
SELECT "emotions".* FROM "emotions"

    def set_emotion
      @emotion = Emotion.find(params[:id])
---
SELECT  "emotions".* FROM "emotions" WHERE "emotions"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]